
package petproject.LabExecutor;

/*
 Составить таблицу кодов блоков для метода Хаффмана с блокированием.
 Вероятности букв считать по фрагменту сообщения в задании.
 Длина блока указана.
 Вычислить EX, ML(X), ML(Xбл).
 Здесь EX – энтропия алфавита из букв сообщения,
 ML(X) – среднее количество элементарных символов на букву
 при сжатии методом Хаффмана,
 ML(Xбл) – среднее количество элементарных символов на букву при сжатии методом Хаффмана с блокированием.

*/
public class BatchHuffmanCoder {

}
